{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "name": "conv2d_1", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "filters": 64, "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [5, 5], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "conv2d_2", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "name": "conv2d_3", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "name": "conv2d_4", "use_bias": true, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "seed": null, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "units": 256, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "activation": "relu", "units": 128, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.4, "seed": null, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "trainable": true, "activation": "softmax", "units": 62, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "keras_version": "2.2.2"}